views/evento/_form.php



    <div class="col-xs-4">
     <?= $form->field($model, 'tipo_evento_id')->dropDownList(
             ArrayHelper::map(TipoEvento::find()->all(), 'id', 'nombre'),
             ['prompt'=>'Seleccionar Tipo Evento']
                 ) ?>
---
SELECT * FROM `tipo_evento`