views/user/_form.php

            <div class="form-group">
    <label for="exampleInputEmail1">Tipo Usuario</label>

             <?php echo Html::dropDownList('rol_id', 1,
           ArrayHelper::map(\app\models\Tipousuario::find()->all(), 'id', 'nombre')); ?>
---
SELECT * FROM `tipousuario`