views/user/inscripcion.php

SELECT * FROM `paquete`
---
        </div>
        <div class="col-xs-4">

         <?= $form->field($modelinscripcion, 'paquete_id')->dropDownList(
            ArrayHelper::map(Paquete::find()->all(), 'id', 'nombre'),
            ['prompt'=>'Seleccionar Paquete']
                ) ?>