controllers/ExpositorController.php

INSERT INTO `expositor` (`user_id`, `nombre`, `estado`) VALUES (43, '', '')
---
    public function actionCreate()
    {
        $model = new Expositor();

        if ($model->load(Yii::$app->request->post())) {

//            $model->archivo= \yii\web\UploadedFile::getInstance($model, 'archivo');
            $model->save();