controllers/TipoEventoController.php

INSERT INTO `tipo_evento` (`nombre`, `estado`, `descripcion`) VALUES ('', 'Activo', '')
---
    public function actionCreate()
    {
        $model = new TipoEvento();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {