controllers/UserController.php

    public function actionCreate()
    {
        $model = new User();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `user` (`nombre`, `apellido_paterno`, `apellido_materno`, `ci`, `fecha_nacimiento`, `email`, `username`, `password`, `telefono`, `ocupacion`, `direccion`, `estado`) VALUES ('expositor', '', '', '', NULL, '', 'expositor1', 'expositor1', NULL, '', '', '')
INSERT INTO `rol_user` (`tipousuario_id`, `user_id`) VALUES (4, 43)

    public function actionInscripcion($id)
    {
        $model = $this->findModel($id);
          $modelinscripcion= new \app\models\Inscripcion();

           if ($modelinscripcion->load(Yii::$app->request->post()))
           {

               //$modelinscripcion->codigoBar=$_POST['codigoBar'];
               //$modelinscripcion->monto=$_POST['monto'];
               $modelinscripcion->user_id=$model->id;
//               $modelinscripcion->save();
                $var=  Inscripcion::findOne(array('user_id'=>$model->id,'evento_id'=>$modelinscripcion->evento_id ));
---
SELECT EXISTS(SELECT * FROM `evento` WHERE `id`='1')