models/EventoExpositorQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `evento_expositor` WHERE `evento_id`=1