models/TemaExpositorQuery.php

SELECT * FROM `tema_expositor` WHERE `expositor_id`=1
---
    public function all($db = null)
    {
        return parent::all($db);