models/User.php

SELECT * FROM `user` WHERE `id`=1
---
       public static  function getAcces($rule,$action) {
     /**
     if(User::findOne(['id'=>Yii::$app->user->id,'rol'=>  User::ROLE_ADMIN]))

SELECT * FROM `user` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        $username = strtolower($username);
        return static::findOne(['username' => $username]);